# Cadence Genus(TM) Synthesis Solution, Version 23.15-s099_1, built Jul 15 2025 14:25:04

# Date: Tue Apr 14 19:36:18 2026
# Host: eda-4.EECS.Berkeley.EDU (x86_64 w/Linux 4.18.0-553.111.1.el8_10.x86_64) (48cores*96cpus*1physical cpu*AMD EPYC 9454 48-Core Processor 1024KB)
# OS:   Red Hat Enterprise Linux 8.10 (Ootpa)

set_db library [list /home/ff/eecs251b/sky130/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib]
read_hdl /scratch/eecs251b-aaj/Final_Project/build/genus/netlist/FFE_synth.v
elaborate FFE
